app/controllers/index_controller.rb

  def index
  	if params[:friends_ids]
      @initiatives = []
      @users = current_user.followed_users
      @users.each do |user|
        initiatives = Initiative.where("user_id" => user.id)
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1