app/controllers/initiatives_controller.rb

  def new
    @initiative = Initiative.new
    @sectors = Sector.all
    @regions = Region.all.collect{|region| [region.name, region.id]}
---
SELECT `sectors`.* FROM `sectors`
SELECT `regions`.* FROM `regions`

  def create
    @initiative = Initiative.new(initiative_params)
    @initiative.user_id = current_user.id.to_i

    #Tags
    tags = params[:tags]
    @tags = tags.split(",")
    @tags.each do |tag|

      #each tag
        @test_tag = Tag.find_by_name(tag)
        if !(@test_tag) #not exists
          @new_tag = Tag.new
          @new_tag.name = tag
          @new_tag.save
        else
          @new_tag = @test_tag
        end
         @initiative.tags << @new_tag
---
SELECT  `tags`.* FROM `tags`  WHERE `tags`.`name` = 'islam' LIMIT 1
INSERT INTO `initiatives` (`created_at`, `image_content_type`, `image_file_name`, `image_file_size`, `image_updated_at`, `updated_at`) VALUES ('2014-06-15 01:47:08', 'image/png', '1002643_587505698006269_403674913_n.png', 26730, '2014-06-15 01:47:07', '2014-06-15 01:47:08')

  def show
    @update_result = []
    @created_at_updates = []
    @initiative_results_updates = []
    @initiative = Initiative.find(params[:id])
   # @initiative.mina
    @updates = Update.where(initiative_id: params[:id]).order('created_at DESC')
    @count= @updates.length
    @comments = Comment.where("commentable_id" => params[:id]).where("commentable_type" => "initiative").order('created_at DESC')
    @results = @initiative.results

    @updates.each do |r|
      @initiative_results_updates.push(r)
      @created_at_updates.push(r.created_at)
    end

    @results.each do |r|
      @initiative_results_updates.push(r)

    end
    @update_result = @initiative_results_updates.sort_by {|obj| obj.created_at}.reverse



    #support initiative
    @supporters = @initiative.users.length
---
SELECT  `users`.* FROM `users`  WHERE `users`.`id` = 1  ORDER BY `users`.`id` ASC LIMIT 1